demo/FSIBeam_pimpleFSIFoam_2206/FSIBeam_pimpleFSIFoam/caseSetup/fluidDomain/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
		
//        type            parabolicInletVelocity;
//        maxVelocity     0.2;
//        tp              1.0;
//        axis            (1 0 0);
//        origin          (0 0 0);
//        value           (0 0 0);
    }
    interface
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
